# Tratamiento de variables categoricas & suma de columnas de un dataset
* Realizaremos tratamiento de variables de tipo (masculino - femenino) para poder realizar una regresion lineal
* Vamos a sumar los datos de varias columnas y a guardar esa suma en una nueva columna

Dataset URL: https://www.kaggle.com/grosvenpaul/family-income-and-expenditure

In [57]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression

In [35]:
dataOriginal = pd.read_csv("../datasets/Family Income and Expenditure.csv")

In [36]:
dataOriginal.head()

,Total Household Income,Region,Total Food Expenditure,Main Source of Income,Agricultural Household indicator,Bread and Cereals Expenditure,Total Rice Expenditure,Meat Expenditure,Total Fish and marine products Expenditure,Fruit Expenditure,...,Number of Refrigerator/Freezer,Number of Washing Machine,Number of Airconditioner,"Number of Car, Jeep, Van",Number of Landline/wireless telephones,Number of Cellular phone,Number of Personal Computer,Number of Stove with Oven/Gas Range,Number of Motorized Banca,Number of Motorcycle/Tricycle
0,480332,CAR,117848,Wage/Salaries,0,42140,38300,24676,16806,3325,...,1,1,0,0,0,2,1,0,0,1
1,198235,CAR,67766,Wage/Salaries,0,17329,13008,17434,11073,2035,...,0,1,0,0,0,3,1,0,0,2
2,82785,CAR,61609,Wage/Salaries,1,34182,32001,7783,2590,1730,...,0,0,0,0,0,0,0,0,0,0
3,107589,CAR,78189,Wage/Salaries,0,34030,28659,10914,10812,690,...,0,0,0,0,0,1,0,0,0,0
4,189322,CAR,94625,Wage/Salaries,0,34820,30167,18391,11309,1395,...,1,0,0,0,0,3,0,0,0,1

Deseo quedarme solo con las columas para replicar el ejercicio de trato de variables.
* Eliminare las innecesarias
* Sumare todos los gastos en una sola columna
* Eliminare los gastos individuales

In [37]:
#lista de columnas deseadas, a parte de las de gastos
deseadas = ['Total Household Income', 'Main Source of Income', 'Total Income from Entrepreneurial Acitivites', 
            'Household Head Sex', 'Household Head Age', 'Household Head Highest Grade Completed',
           'Household Head Job or Business Indicator', 'Total Number of Family members', 'Total number of family members employed']

In [38]:
gastos =['Total Food Expenditure',
         'Clothing, Footwear and Other Wear Expenditure','Housing and water Expenditure', 
         'Medical Care Expenditure','Transportation Expenditure',
         'Education Expenditure',
         'Communication Expenditure']
# variables extraidas para mejorar el total (haer la mayoria del gasto menor que el ingreso
# 'Alcoholic Beverages Expenditure','Tobacco Expenditure'
# 'Special Occasions Expenditure'
# 'Crop Farming and Gardening expenses'
# 'Miscellaneous Goods and Services Expenditure',
# 'Restaurant and hotels Expenditure',

In [39]:
deseadas

['Total Household Income',
 'Main Source of Income',
 'Total Income from Entrepreneurial Acitivites',
 'Household Head Sex',
 'Household Head Age',
 'Household Head Highest Grade Completed',
 'Household Head Job or Business Indicator',
 'Total Number of Family members',
 'Total number of family members employed']

In [40]:
data = dataOriginal[deseadas]
data.head()

,Total Household Income,Main Source of Income,Total Income from Entrepreneurial Acitivites,Household Head Sex,Household Head Age,Household Head Highest Grade Completed,Household Head Job or Business Indicator,Total Number of Family members,Total number of family members employed
0,480332,Wage/Salaries,44370,Female,49,Teacher Training and Education Sciences Programs,With Job/Business,4,1
1,198235,Wage/Salaries,0,Male,40,Transport Services Programs,With Job/Business,3,2
2,82785,Wage/Salaries,0,Male,39,Grade 3,With Job/Business,6,3
3,107589,Wage/Salaries,15580,Male,52,Elementary Graduate,With Job/Business,3,2
4,189322,Wage/Salaries,75687,Male,65,Elementary Graduate,With Job/Business,4,2

In [41]:
sumexpenses = dataOriginal[gastos].sum(axis = 1, skipna = True)

In [42]:
sumexpenses

0        233404
1        168786
2         79923
3        104077
4        139603
          ...
41539     67710
41540     58501
41541     61242
41542    106650
41543     94761
Length: 41544, dtype: int64

In [43]:
data.loc[:,'Total Expenses'] = sumexpenses

C:\Users\luisb\Anaconda3\lib\site-packages\pandas\core\indexing.py:376: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = _infer_fill_value(value)
C:\Users\luisb\Anaconda3\lib\site-packages\pandas\core\indexing.py:494: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

In [44]:
data.head(25)

,Total Household Income,Main Source of Income,Total Income from Entrepreneurial Acitivites,Household Head Sex,Household Head Age,Household Head Highest Grade Completed,Household Head Job or Business Indicator,Total Number of Family members,Total number of family members employed,Total Expenses
0,480332,Wage/Salaries,44370,Female,49,Teacher Training and Education Sciences Programs,With Job/Business,4,1,233404
1,198235,Wage/Salaries,0,Male,40,Transport Services Programs,With Job/Business,3,2,168786
2,82785,Wage/Salaries,0,Male,39,Grade 3,With Job/Business,6,3,79923
3,107589,Wage/Salaries,15580,Male,52,Elementary Graduate,With Job/Business,3,2,104077
4,189322,Wage/Salaries,75687,Male,65,Elementary Graduate,With Job/Business,4,2,139603
5,152883,Wage/Salaries,0,Male,46,Second Year High School,With Job/Business,4,3,103677
6,198621,Wage/Salaries,72290,Male,45,Third Year High School,With Job/Business,5,1,151584
7,134961,Other sources of Income,51840,Male,33,Business and Administration Programs,With Job/Business,5,0,147770
8,171152,Other sources of Income,0,Female,17,First Year College,No Job/Business,2,0,95698
9,625753,Enterpreneurial Activities,312974,Male,53,High School Graduate,With Job/Business,6,1,259517
10,147005,Enterpreneurial Activities,94140,Male,49,Other Programs in Education at the Third Level...,With Job/Business,4,1,116365
11,253130,Wage/Salaries,89760,Male,35,High School Graduate,With Job/Business,7,5,144711
12,101111,Enterpreneurial Activities,49745,Male,38,Elementary Graduate,With Job/Business,7,2,108822
13,128214,Enterpreneurial Activities,58875,Male,53,Humanities Programs,No Job/Business,3,0,115471
14,91525,Other sources of Income,33540,Male,75,Elementary Graduate,No Job/Business,2,0,71099
15,171742,Other sources of Income,19240,Female,36,First Year High School,No Job/Business,4,0,101597
16,95385,Wage/Salaries,35475,Male,67,Grade 6,With Job/Business,5,1,105857
17,142843,Wage/Salaries,37893,Male,57,High School Graduate,With Job/Business,8,1,106879
18,88170,Enterpreneurial Activities,42190,Female,63,Elementary Graduate,With Job/Business,4,3,90722
19,97018,Enterpreneurial Activities,77838,Male,40,Elementary Graduate,With Job/Business,5,1,106084
20,123015,Enterpreneurial Activities,72315,Male,60,High School Graduate,With Job/Business,4,2,117259
21,100900,Enterpreneurial Activities,55510,Male,62,Grade 4,With Job/Business,4,2,93666
22,153312,Other sources of Income,59410,Male,45,Engineering and Engineering Trades Programs,With Job/Business,6,1,203764
23,96814,Wage/Salaries,0,Male,41,Second Year High School,With Job/Business,5,1,85581
24,91785,Enterpreneurial Activities,46115,Male,43,Grade 3,With Job/Business,3,1,93777

## Tratamiento de variables categoricas
* las variables de 'Household Head Sex' y 'Household Head Job or Business Indicator' son categoricas, en este caso solo dos posibles para cada una.
* Crearemos variables Dummy para ambos casos

In [45]:
dummy_genderHead = pd.get_dummies(data["Household Head Sex"], prefix="Gender Head")
dummy_stateJob = pd.get_dummies(data["Household Head Job or Business Indicator"], prefix="State Job")
#esto dara una columna para cada valor y las llenara con 0´s y 1´s si aplica o no

In [46]:
dummy_genderHead.head()

   Gender Head_Female  Gender Head_Male
0                   1                 0
1                   0                 1
2                   0                 1
3                   0                 1
4                   0                 1

In [47]:
dummy_stateJob.head()

   State Job_No Job/Business  State Job_With Job/Business
0                          0                            1
1                          0                            1
2                          0                            1
3                          0                            1
4                          0                            1

Realizaremos un Join con nuestro dataset principal

In [48]:
column_names = data.columns.values.tolist() #tomo los nombres de las columnas y los guardo en una lista 
column_names

['Total Household Income',
 'Main Source of Income',
 'Total Income from Entrepreneurial Acitivites',
 'Household Head Sex',
 'Household Head Age',
 'Household Head Highest Grade Completed',
 'Household Head Job or Business Indicator',
 'Total Number of Family members',
 'Total number of family members employed',
 'Total Expenses']

In [49]:
data_new = data[column_names].join(dummy_genderHead)#uno las columnas actuales con los datos dummy de genero
column_names = data_new.columns.values.tolist()#guardo los nuevos nombres de columnas
data_new.head()

,Total Household Income,Main Source of Income,Total Income from Entrepreneurial Acitivites,Household Head Sex,Household Head Age,Household Head Highest Grade Completed,Household Head Job or Business Indicator,Total Number of Family members,Total number of family members employed,Total Expenses,Gender Head_Female,Gender Head_Male
0,480332,Wage/Salaries,44370,Female,49,Teacher Training and Education Sciences Programs,With Job/Business,4,1,233404,1,0
1,198235,Wage/Salaries,0,Male,40,Transport Services Programs,With Job/Business,3,2,168786,0,1
2,82785,Wage/Salaries,0,Male,39,Grade 3,With Job/Business,6,3,79923,0,1
3,107589,Wage/Salaries,15580,Male,52,Elementary Graduate,With Job/Business,3,2,104077,0,1
4,189322,Wage/Salaries,75687,Male,65,Elementary Graduate,With Job/Business,4,2,139603,0,1

Agregamos ahora el State Job

In [51]:
data_new = data_new[column_names].join(dummy_city_tier)
data_new.head()

,Total Household Income,Main Source of Income,Total Income from Entrepreneurial Acitivites,Household Head Sex,Household Head Age,Household Head Highest Grade Completed,Household Head Job or Business Indicator,Total Number of Family members,Total number of family members employed,Total Expenses,Gender Head_Female,Gender Head_Male,State Job_No Job/Business,State Job_With Job/Business
0,480332,Wage/Salaries,44370,Female,49,Teacher Training and Education Sciences Programs,With Job/Business,4,1,233404,1,0,0,1
1,198235,Wage/Salaries,0,Male,40,Transport Services Programs,With Job/Business,3,2,168786,0,1,0,1
2,82785,Wage/Salaries,0,Male,39,Grade 3,With Job/Business,6,3,79923,0,1,0,1
3,107589,Wage/Salaries,15580,Male,52,Elementary Graduate,With Job/Business,3,2,104077,0,1,0,1
4,189322,Wage/Salaries,75687,Male,65,Elementary Graduate,With Job/Business,4,2,139603,0,1,0,1

Ahora vamos a integrar esos valores a nuestro modelo

In [59]:
mis_predictoras = ['Total Household Income', 'Total Income from Entrepreneurial Acitivites', 
                   'Household Head Age','Total Number of Family members',
                   'Total number of family members employed','Gender Head_Male', 'Gender Head_Female', 
                   'State Job_No Job/Business', 'State Job_With Job/Business']

**NOTA IMPORTANTE** Recuerda que para la regresion lineal solo usamos variables numericas. Es por eso que nos tomamos el trabajo de convertir categorias a estados binarios

In [60]:
X = data_new[mis_predictoras]
Y = data_new['Total Expenses']#intento predecir gastos

### Creamos el modelo

In [61]:
lm = LinearRegression()#cargo objeto en la variable
lm.fit(X,Y)#inicio entrenamiento

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [62]:
lm.intercept_

42531.26095049248

In [63]:
lm.coef_

array([ 4.35584682e-01, -1.98772117e-01, -6.49620452e+01,  6.89198892e+03,
       -4.59542366e+03, -1.05816354e+03,  1.05816354e+03,  4.31886103e+03,
       -4.31886103e+03])

In [ ]:
list(zip(mis_predictoras, lm.coef_))
#Gender Female y Gender male tienen los mismos valores (positivo y negativo)
# igual con las de Job

In [65]:
lm.score(X,Y)#R2, Este Valor no es muy muy bueno. incluso podria tomarse por NO Aceptable.

0.7099306139315616

El bajo valor puede deberse a que la relacion entre estas varaibles no es lineal o bien a que falta informacion del dataset original que hemos operado

**¿que sigue?**
- Realizar el modelo de forma manual para agregar las predicciones al dataset
- Revisar los parametros de error
- Eliminar variables dummy redundantes (genero)
- Graficar para ver la relacion entre ingresos y gastos